---
kind: type
id: T:Autodesk.Revit.DB.CompoundStructureLayer
source: html/faece83a-6d49-41b0-2713-fe6cfaa5a3b5.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer

Describes a single layer in a CompoundStructure.

## Syntax (C#)
```csharp
public class CompoundStructureLayer : IDisposable
```